realsosy/InfineonRacer/2_src/InfineonRacer_TC23xA/0_Src/4_McHal/Tricore/Eray/Std/IfxEray.h
/** \brief Sets max limit correction values.
 * \param eray pointer to ERAY module registers.
 * \param maxOffsetCorrection maximum offset correction.
 * \param maxRateCorrection maximum rate correction.
 * \return None
 */
IFX_INLINE void IfxEray_setMaxCorrectionValues(Ifx_ERAY *eray, uint16 maxOffsetCorrection, uint16 maxRateCorrection);

/** \brief Sets maximum synch frames in a cluster.
 * \param eray pointer to ERAY module registers.
 * \param maxSyncFrames maximum synch frames in a cluster.
 * \return None
 */
IFX_INLINE void IfxEray_setMaxSynchFrames(Ifx_ERAY *eray, IfxEray_MaxSynchFrames maxSyncFrames);

/** \brief Sets number of message buffers.
 * \param eray pointer to ERAY module registers.
 * \param numberOfMessageBuffers number of message buffers.
 * \return None
 */
IFX_INLINE void IfxEray_setMessageBufferCount(Ifx_ERAY *eray, uint8 numberOfMessageBuffers);

/** \brief Sets Message Handler configurations.
 * \param eray pointer to ERAY module registers.
 * \param staticFramepayload payload length of static frames in double bytes.
 * \param latestTransmissionStart dynamic slots befor transmission of inhibit frame in dynamic segment.
 * \return None
 */
IFX_INLINE void IfxEray_setMessageHandlerConfigurations(Ifx_ERAY *eray, uint8 staticFramepayload, uint8 latestTransmissionStart);

/** \brief Sets network start Idle time.
 * \param eray pointer to ERAY module registers.
 * \param networkStartIdleTime starting point of Network Idle Time Phase.
 * \return None
 */
IFX_INLINE void IfxEray_setNetworkStartIdleTime(Ifx_ERAY *eray, uint16 networkStartIdleTime);

/** \brief Sets network management vector length.
 * \param eray pointer to ERAY module registers.
 * \param networkVectorLength length of network management vector.
 * \return None
 */
IFX_INLINE void IfxEray_setNetworkVectorLength(Ifx_ERAY *eray, uint32 networkVectorLength);

/** \brief Sets channels connected to node.
 * \param eray pointer to ERAY module registers.
 * \param channelAConnectedNode whether node connected to channel A or not.
 * \param channelBConnectedNode whether node connected to channel B or not.
 * \return None
 */
IFX_INLINE void IfxEray_setNodeChannels(Ifx_ERAY *eray, boolean channelAConnectedNode, boolean channelBConnectedNode);

/** \brief Sets offset correction starting point.
 * \param eray pointer to ERAY module registers.
 * \param correctionOffset offset correction start point.
 * \return None
 */
IFX_INLINE void IfxEray_setOffsetCorrection(Ifx_ERAY *eray, uint16 correctionOffset);

/** \brief requests to receive the frame.
 * \param eray pointer to ERAY module registers.
 * \param receiveRequested whether frame to be received or not.
 * \return None
 */
IFX_INLINE void IfxEray_setReceiveRequest(Ifx_ERAY *eray, boolean receiveRequested);

/** \brief Sets receive wakeup times.
 * \param eray pointer to ERAY module registers.
 * \param receiveWakeupTestDuration duration of receive wakeup pattern.
 * \param receiveWakeupIdleTime duration of receive wakeup idle time.
 * \param receiveWakeupLowTime duration of receive wakeup low time.
 * \return None
 */
IFX_INLINE void IfxEray_setReceiveWakeupTimes(Ifx_ERAY *eray, uint8 receiveWakeupTestDuration, uint8 receiveWakeupIdleTime, uint8 receiveWakeupLowTime);

/** \brief sets buffer number in which frame is received.
 * \param eray pointer to ERAY module registers.
 * \param bufferIndex buffer number in which frame is received.
 * \return None
 */
IFX_INLINE void IfxEray_setRxBufferNumber(Ifx_ERAY *eray, uint8 bufferIndex);

/** \brief Sets slots action points.
 * \param eray pointer to ERAY module registers.
 * \param staticActionPoint static slots and symbol window action point.
 * \param dynamicActionPoint dynamic slots action point.
 * \return None
 */
IFX_INLINE void IfxEray_setSlotActionPoints(Ifx_ERAY *eray, uint8 staticActionPoint, uint8 dynamicActionPoint);

/** \brief Sets static slots count and length.
 * \param eray pointer to ERAY module registers.
 * \param staticSlotLength duration of static slot in macroticks.
 * \param staticSlotsCount number of static slots in a communication cycle.
 * \return None
 */
IFX_INLINE void IfxEray_setStaticSlots(Ifx_ERAY *eray, uint16 staticSlotLength, uint16 staticSlotsCount);

/** \brief Sets sample point for strobing.
 * \param eray pointer to ERAY module registers.
 * \param strobePosition strobing sample count.
 * \return None
 */
IFX_INLINE void IfxEray_setStrobePosition(Ifx_ERAY *eray, IfxEray_StrobePosition strobePosition);

/** \brief Sets channels which transmits symbols.
 * \param eray pointer to ERAY module registers.
 * \param channelASymbolTransmitted whether symbol is transmitted in Channel A or not.
 * \param channelBSymbolTransmitted whether symbol is transmitted in Channel B or not.
 * \return None
 */
IFX_INLINE void IfxEray_setSymbolChannels(Ifx_ERAY *eray, boolean channelASymbolTransmitted, boolean channelBSymbolTransmitted);

/** \brief Sets the transmit slot mode.
 * \param eray pointer to ERAY module registers.
 * \param transmissionSlotMode transmission slot mode.
 * \return None
 */
IFX_INLINE void IfxEray_setTransmissionSlotMode(Ifx_ERAY *eray, IfxEray_TransmissionSlotMode transmissionSlotMode);

/** \brief Sets transmission start time duration.
 * \param eray pointer to ERAY module registers.
 * \param transmissionStartTime transmission start time.
 * \return None
 */
IFX_INLINE void IfxEray_setTransmissionStartTime(Ifx_ERAY *eray, uint16 transmissionStartTime);

/** \brief Sets transfer request to send frame.
 * \param eray pointer to ERAY module registers.
 * \param transferRequested whether transfer requested or not.
 * \return None
 */
IFX_INLINE void IfxEray_setTransmitRequest(Ifx_ERAY *eray, boolean transferRequested);

/** \brief Sets transmit wakeup times.
 * \param eray pointer to ERAY module registers.
 * \param transmitWakeupRepetitions transmission wakeup repetitions.
 * \param transmitWakeupIdleTime duration of transmit wakeup idle time.
 * \param transmitWakeupLowTime duration of transmit wakeup low time.
 * \return None
 */
IFX_INLINE void IfxEray_setTransmitWakeupTimes(Ifx_ERAY *eray, uint8 transmitWakeupRepetitions, uint8 transmitWakeupIdleTime, uint8 transmitWakeupLowTime);

